tap "azure/azd"
tap "azure/kubelogin"
tap "bossjones/asdf-versions"
tap "bossjones/tap", "git@github.com:bossjones/homebrew-tap.git"
tap "caarlos0/tap"
tap "chipmk/tap"
tap "cue-lang/tap"
tap "goreleaser/tap"
tap "guumaster/tap"
tap "hacker1024/hacker1024"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jesseduffield/lazydocker"
tap "johanhaleby/kubetail"
tap "jrockway/tap"
tap "kadwanev/brew"
tap "kdash-rs/kdash"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "lencx/nofwl"
tap "mananapr/cfiles"
tap "minio/stable"
tap "moncho/dry"
tap "noahgorstein/tap"
tap "predatorray/brew"
tap "reactiveops/tap"
tap "robusta-dev/krr"
tap "schniz/tap"
tap "simonw/llm"
tap "teamookla/speedtest"
tap "textualize/homebrew"
tap "vectordotdev/brew"
brew "ack"
brew "act"
brew "actionlint"
brew "libpng"
brew "libunistring"
brew "gettext"
brew "glib"
brew "openssl@3"
brew "xz"
brew "python@3.12"
brew "cairo"
brew "libtiff"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "age"
brew "angle-grinder"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "ansible"
brew "openexr"
brew "jpeg-xl"
brew "aom"
brew "protobuf"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "argo"
brew "argocd"
brew "libssh2"
brew "aria2"
brew "asdf"
brew "atomicparsley"
brew "autoconf"
brew "libtool"
brew "pkgconf"
brew "guile"
brew "autogen"
brew "automake"
brew "autossh"
brew "aws-iam-authenticator"
brew "awscli"
brew "bandwhich"
brew "bash"
brew "node"
brew "bash-language-server"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "bazel"
brew "berkeley-db", link: true
brew "bind"
brew "boost"
brew "broot"
brew "bsdmake"
brew "bzip2"
brew "caire"
brew "ccache"
brew "pcre"
brew "ccze"
brew "eigen"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "libomp", link: true
brew "suite-sparse"
brew "tbb"
brew "cgal"
brew "hdf5"
brew "yamale"
brew "chart-testing"
brew "cheat"
brew "checkbashisms"
brew "checkmake"
brew "cidr2range"
brew "cilium-cli"
brew "cloc"
brew "clusterctl"
brew "cmake"
brew "cmake-docs"
brew "cmake-language-server"
brew "cog"
brew "colordiff"
brew "commitizen"
brew "cookiecutter"
brew "cowsay"
brew "cscope"
brew "csvlens"
brew "ctags"
brew "ctop"
brew "rtmpdump"
brew "curl"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "librist"
brew "libvpx"
brew "sdl2"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "gtk4"
brew "shared-mime-info"
brew "libheif"
brew "czkawka"
brew "deno"
brew "go"
brew "dep"
brew "dfc"
brew "diff-so-fancy"
brew "diffstat"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "dive"
brew "dns2tcp"
brew "dnsmasq"
brew "python@3.11"
brew "ldns"
brew "dnsperf"
brew "dnstop"
brew "dockerfile-language-server"
brew "docutils"
brew "dos2unix"
brew "doxygen"
brew "dua-cli"
brew "duf"
brew "dust"
brew "duti"
brew "numpy"
brew "dvc"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "editorconfig"
brew "entr"
brew "etcd"
brew "exiftool"
brew "openssl@1.1"
brew "tcl-tk"
brew "expect"
brew "fd"
brew "fdupes"
brew "ffmpeg@6"
brew "figlet"
brew "findutils"
brew "fnm"
brew "fontforge"
brew "foremost"
brew "fortune"
brew "fping"
brew "fpp"
brew "fswatch"
brew "fx"
brew "fzf"
brew "gawk"
brew "gd"
brew "gnupg"
brew "gpgme"
brew "proj"
brew "libspatialite"
brew "netcdf"
brew "poppler"
brew "gdal"
brew "gh"
brew "ghc"
brew "ghostscript"
brew "ghq"
brew "gifsicle"
brew "gist"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "git-sizer"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go-jsonnet"
brew "go-task"
brew "gobject-introspection"
brew "golangci-lint"
brew "gotestsum"
brew "goto"
brew "gpatch"
brew "gping"
brew "openjdk"
brew "gradle"
brew "grafana"
brew "graphicsmagick"
brew "netpbm"
brew "gts"
brew "graphviz"
brew "grep"
brew "gron"
brew "grpcurl"
brew "gum"
brew "gzip"
brew "hadolint"
brew "hashcat"
brew "uv"
brew "hatch"
brew "helm"
brew "helm-docs"
brew "helmfile"
brew "hexyl"
brew "highlight"
brew "htop"
brew "http-prompt"
brew "httpie"
brew "httpstat"
brew "hub"
brew "hyperfine"
brew "iftop"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "iperf"
brew "jpeg", link: true
brew "jq"
brew "jsonnet-bundler"
brew "pandoc"
brew "jupyterlab"
brew "just"
brew "k3d"
brew "k6"
brew "kind"
brew "knot"
brew "ksops"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kubent"
brew "kubespy"
brew "kubeval"
brew "kustomize"
brew "langgraph-cli"
brew "lazydocker"
brew "less"
brew "lesspipe"
brew "libav"
brew "libdap"
brew "libffi"
brew "libmagic"
brew "libmediainfo"
brew "libxslt"
brew "lnav"
brew "lsof"
brew "lua-language-server"
brew "luarocks"
brew "luv"
brew "make"
brew "makedepend"
brew "mcrypt"
brew "mercurial"
brew "mitmproxy"
brew "mkcert"
brew "moreutils"
brew "most"
brew "mtr"
brew "mvfst"
brew "nasm"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nethogs"
brew "netperf"
brew "ngrep"
brew "ninja"
brew "nload"
brew "nmap"
brew "nnn"
brew "node@22"
brew "noti"
brew "opa"
brew "pmix"
brew "open-mpi"
brew "openconnect"
brew "openvino"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "openjdk@17"
brew "openshift-cli"
brew "packer"
brew "tree"
brew "pass"
brew "pdm"
brew "peco"
brew "perl"
brew "pgcli"
brew "pipes-sh"
brew "popeye"
brew "postgresql@14"
brew "pre-commit"
brew "procs"
brew "proctools"
brew "prometheus"
brew "proxychains-ng"
brew "psgrep"
brew "pstree"
brew "pup"
brew "pv"
brew "pwgen"
brew "py-spy"
brew "pyenv"
brew "pyenv-ccache"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "qt@5"
brew "pyqt@5"
brew "python-tk@3.11"
brew "python@3.10"
brew "python@3.9"
brew "qpdf"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "repomix"
brew "ripgrep"
brew "ripgrep-all"
brew "rsync"
brew "rust"
brew "rustup"
brew "screen"
brew "screenfetch"
brew "sdl2_mixer"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "siege"
brew "sonobuoy"
brew "sops"
brew "terminal-notifier"
brew "sql-language-server"
brew "ssh-copy-id"
brew "superfile"
brew "sysdig"
brew "tanka"
brew "taplo"
brew "tccutil"
brew "tcptraceroute"
brew "terraform"
brew "tesseract-lang"
brew "tflint"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "traefik"
brew "trash", link: true
brew "tre-command"
brew "trivy"
brew "trufflehog"
brew "typescript"
brew "typescript-language-server"
brew "unar"
brew "unzip"
brew "urlview"
brew "vale"
brew "vault"
brew "vcluster"
brew "velero"
brew "vim"
brew "virtualenv"
brew "watch"
brew "watchman"
brew "wget"
brew "whatmask"
brew "whois"
brew "wrk"
brew "xq"
brew "yaml-language-server"
brew "yank"
brew "yazi"
brew "youtube-dl"
brew "yq"
brew "yt-dlp", link: false
brew "zlib"
brew "zoxide"
brew "zsh"
brew "azure/azd/azd"
brew "azure/kubelogin/kubelogin"
brew "caarlos0/tap/svu"
brew "chipmk/tap/docker-mac-net-connect"
brew "cue-lang/tap/cue"
brew "goreleaser/tap/goreleaser"
brew "guumaster/tap/hostctl"
brew "hacker1024/hacker1024/coretemp"
brew "johanhaleby/kubetail/kubetail"
brew "jrockway/tap/jlog"
brew "jrockway/tap/kubectl-jq"
brew "kadwanev/brew/retry"
brew "kdash-rs/kdash/kdash"
brew "mananapr/cfiles/cfiles"
brew "minio/stable/mc"
brew "moncho/dry/dry"
brew "noahgorstein/tap/jqp"
brew "predatorray/brew/kubectl-tmux-exec"
brew "reactiveops/tap/polaris"
brew "robusta-dev/krr/krr"
brew "simonw/llm/symbex"
brew "teamookla/speedtest/speedtest"
brew "textualize/homebrew/frogmouth"
brew "vectordotdev/brew/vector"
cask "1password-cli"
cask "amethyst"
cask "appzapper"
cask "balenaetcher"
cask "calibre"
cask "clickhouse"
cask "contour"
cask "cool-retro-term"
cask "cursor"
cask "db-browser-for-sqlite"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-liberation"
cask "font-liberation-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "gimp"
cask "github"
cask "hakuneko"
cask "hyper"
cask "iina"
cask "libreoffice"
cask "mysqlworkbench"
cask "nofwl"
cask "openemu"
cask "pgadmin4"
cask "phantomjs"
cask "redis-insight"
cask "rio"
cask "sloth"
cask "sysdig-inspect"
cask "trunk-io"
cask "vlc"
cask "warp"
cask "wireshark"
cask "xquartz"
cask "yacreader"
cask "zed"
vscode "4ops.terraform"
vscode "adamhartford.vscode-base64"
vscode "adguard.adblock"
vscode "arcsector.vscode-splunk-search-linter"
vscode "arcsector.vscode-splunk-search-syntax"
vscode "arturodent.custom-language-syntax"
vscode "artymaury.template-finder"
vscode "aws-scripting-guy.cform"
vscode "bbenoist.nix"
vscode "be5invis.toml"
vscode "bibhasdn.unique-lines"
vscode "charliermarsh.ruff"
vscode "chenzhe.split-line"
vscode "christian-kohler.path-intellisense"
vscode "coolbear.systemd-unit-file"
vscode "cybai.yaml-key-viewer"
vscode "darkriszty.markdown-table-prettify"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "fabiospampinato.vscode-diff"
vscode "flesler.url-encode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "geeksharp.openssl-configuration-file"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "glenbuktenica.unicode-substitutions"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "haaleo.timing"
vscode "hangxingliu.vscode-systemd-support"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "hoovercj.vscode-power-mode"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "inu1255.easy-snippet"
vscode "j-zeppenfeld.tab-indent-space-align"
vscode "jack89ita.open-file-from-path"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jetmartin.bats"
vscode "jkiviluoto.tws"
vscode "joshuapoehls.json-escaper"
vscode "kaiwood.endwise"
vscode "karyan40024.gotmpl-syntax-highlighter"
vscode "koichisasada.vscode-rdbg"
vscode "korekontrol.saltstack"
vscode "lixquid.calculator"
vscode "malmaud.tmux"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "misogi.ruby-rubocop"
vscode "mongodb.mongodb-vscode"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.sublime-keybindings"
vscode "naumovs.color-highlight"
vscode "nidu.copy-json-path"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "paulvarache.vscode-taskfile"
vscode "pepri.subtitles-editor"
vscode "peterschmalfeldt.explorer-exclude"
vscode "petli-full.json-to-yaml-and-more"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "richie5um2.vscode-statusbar-json-path"
vscode "robbowen.synthwave-vscode"
vscode "roscop.activefileinstatusbar"
vscode "ruiquelhas.vscode-uppercase"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sadesyllas.explorer-excluded-files"
vscode "samuelcolvin.jinjahtml"
vscode "sankooc.pcapviewer"
vscode "secsamdev.grok"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "signageos.signageos-vscode-sops"
vscode "simonsiefke.svg-preview"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "smoore.yaml-path"
vscode "sourcegraph.cody-ai"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "teddylun.json-utils"
vscode "thegtproject.hoverhex"
vscode "thinker.sort-json"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "tsandall.opa"
vscode "twxs.cmake"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "wattenberger.footsteps"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "xadillax.viml"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
