tap "eth-p/software"
tap "github/gh"
tap "guumaster/tap"
tap "hacker1024/hacker1024"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "muesli/tap"
tap "schniz/tap"
brew "xz"
brew "ansible"
brew "ansifilter"
brew "libpng"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "aria2"
brew "as-tree"
brew "coreutils"
brew "asdf"
brew "atomicparsley"
brew "pkg-config"
brew "guile"
brew "autogen"
brew "autossh"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bats-core"
brew "bind"
brew "bsdmake"
brew "bzip2"
brew "glib"
brew "libffi"
brew "python@3.9"
brew "cairo"
brew "ccache"
brew "ccze"
brew "cheat"
brew "checkbashisms"
brew "cidr2range"
brew "cifer"
brew "clib"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "python@3.10"
brew "cookiecutter"
brew "cscope"
brew "ctags"
brew "ctop"
brew "curl"
brew "go"
brew "dep"
brew "dfc"
brew "diff-so-fancy"
brew "diffstat"
brew "diffutils"
brew "direnv"
brew "docker", link: false
brew "docker-compose"
brew "docker-machine"
brew "docker-machine-driver-vmware"
brew "docker-machine-nfs"
brew "dos2unix"
brew "doxygen"
brew "dust"
brew "editorconfig"
brew "eigen"
brew "exiftool"
brew "expect"
brew "fd"
brew "fdupes"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "pango"
brew "sdl2"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "figlet"
brew "findutils"
brew "fnm"
brew "fontforge"
brew "foremost"
brew "fortune"
brew "fping"
brew "fpp"
brew "fswatch"
brew "fx"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gdk-pixbuf"
brew "gh"
brew "ghc"
brew "ghq"
brew "gist"
brew "git"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "goaccess"
brew "gobject-introspection"
brew "goto"
brew "gpatch"
brew "gradle"
brew "jpeg", link: true
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gron"
brew "grv"
brew "guile@2"
brew "gzip"
brew "hadolint"
brew "handbrake", link: false
brew "hatch"
brew "hdf5"
brew "highlight"
brew "htop"
brew "httpie"
brew "httpstat"
brew "hub"
brew "hyperfine"
brew "icdiff"
brew "ifstat"
brew "iftop"
brew "shared-mime-info"
brew "libheif"
brew "libomp", link: true
brew "imagemagick"
brew "iperf"
brew "iproute2mac"
brew "jq"
brew "json-glib"
brew "jsonrpc-glib"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "less"
brew "lesspipe"
brew "libav", link: false
brew "libmagic"
brew "libxml2"
brew "libxslt"
brew "lsof"
brew "luarocks"
brew "luv"
brew "makedepend"
brew "mas"
brew "masscan"
brew "md5sha1sum", link: false
brew "meilisearch"
brew "mercurial"
brew "mkcert"
brew "mmv"
brew "moreutils"
brew "mujs"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "mtr"
brew "multitail"
brew "mutt"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "xapian"
brew "notmuch"
brew "neomutt"
brew "neovim"
brew "netcat"
brew "nethogs"
brew "netperf"
brew "nghttp2"
brew "ngrep"
brew "nload"
brew "nmap"
brew "nnn"
brew "node"
brew "nvm"
brew "open-mpi"
brew "openblas"
brew "osx-cpu-temp"
brew "packer"
brew "pandoc", link: false
brew "tree"
brew "pass"
brew "peco"
brew "perl"
brew "pipes-sh"
brew "postgresql@14"
brew "prettier"
brew "proctools"
brew "proxychains-ng"
brew "psgrep"
brew "pstree"
brew "pup"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "pyenv-which-ext"
brew "ruby-build"
brew "rbenv"
brew "rbspy"
brew "reattach-to-user-namespace"
brew "remake"
brew "rename"
brew "rig"
brew "ripgrep"
brew "rkhunter"
brew "rlwrap"
brew "rsync"
brew "screen"
brew "screenfetch"
brew "sdl2_mixer"
brew "selenium-server"
brew "sha2"
brew "shellcheck"
brew "shfmt"
brew "slowhttptest"
brew "socat"
brew "ssh-copy-id"
brew "ssldump"
brew "sslscan"
brew "subversion"
brew "task"
brew "taskd"
brew "tasksh"
brew "tbb"
brew "tcl-tk", link: false
brew "tcpdump"
brew "tcpreplay"
brew "tcpstat"
brew "tcptrace"
brew "terminal-notifier"
brew "terraform"
brew "texinfo"
brew "the_silver_searcher"
brew "tig"
brew "tkdiff"
brew "tmuxinator-completion"
brew "unzip"
brew "urlview"
brew "vale"
brew "vault"
brew "vegeta"
brew "velero"
brew "vim"
brew "watch"
brew "wget"
brew "whatmask"
brew "whois"
brew "wrk"
brew "yank"
brew "youtube-dl"
brew "yubico-piv-tool"
brew "z"
brew "zlib"
brew "zsh"
brew "eth-p/software/bat-extras"
brew "guumaster/tap/hostctl"
brew "hacker1024/hacker1024/coretemp"
brew "heroku/brew/heroku"
brew "johanhaleby/kubetail/kubetail"
brew "muesli/tap/duf"
cask "db-browser-for-sqlite"
cask "fluid"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "gimp"
cask "handbrake"
cask "handbrakebatch"
cask "hyper"
cask "iina"
cask "jdownloader"
cask "phantomjs"
cask "vlc"
mas "EtreCheck", id: 1423715984
mas "GarageBand", id: 682658836
mas "GrandPerspective", id: 1111570163
mas "HP Smart", id: 1474276998
mas "iLove Audio Cut", id: 901148229
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
vscode "29ways.boss"
vscode "adamhartford.vscode-base64"
vscode "akamud.vscode-theme-onedark"
vscode "albymor.increment-selection"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "Artymaury.template-finder"
vscode "Asuka.insertnumbers"
vscode "awarest.awarest-align"
vscode "bdavs.expect"
vscode "bibhasdn.unique-lines"
vscode "brunomartens.bma-coverage"
vscode "bungcip.better-toml"
vscode "caarlos0.language-prometheus"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "coolbear.systemd-unit-file"
vscode "cweijan.vscode-office"
vscode "cybai.yaml-key-viewer"
vscode "dariofuzinato.vscode-download-file"
vscode "darkriszty.markdown-table-prettify"
vscode "devine-davies.make-hidden"
vscode "diegofn.vscode-uriencode"
vscode "donjayamanne.createuniqueid"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.listFiles"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "drphrozen.escaping-characters"
vscode "eamodio.gitlens"
vscode "earshinov.sort-lines-by-selection"
vscode "EditorConfig.EditorConfig"
vscode "emilast.LogFileHighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enochc.copy-relative-path"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "erikphansen.vscode-toggle-column-selection"
vscode "esbenp.prettier-vscode"
vscode "ExodiusStudios.comment-anchors"
vscode "fbaligand.vscode-logstash-editor"
vscode "felipecaputo.git-project-manager"
vscode "ferdinandsilva.vsc-figlet"
vscode "file-icons.file-icons"
vscode "flesler.url-encode"
vscode "formulahendry.code-runner"
vscode "fosshaas.fontsize-shortcuts"
vscode "foxundermoon.shell-format"
vscode "freakypie.code-python-isort"
vscode "frhtylcn.pythonsnippets"
vscode "geddski.macros"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "ginfuru.vscode-jekyll-snippets"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "GlenBuktenica.unicode-substitutions"
vscode "golang.go"
vscode "graykode.ai-docstring"
vscode "hangxingliu.vscode-nginx-conf-hint"
vscode "hashicorp.terraform"
vscode "helixquar.asciidecorator"
vscode "henriiik.vscode-sort"
vscode "heyimfuzz.banner-comments"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hoovercj.vscode-power-mode"
vscode "idleberg.applescript"
vscode "ipedrazas.kubernetes-snippets"
vscode "j-zeppenfeld.tab-indent-space-align"
vscode "jakebathman.nginx-log-highlighter"
vscode "janisdd.vscode-edit-csv"
vscode "jetmartin.bats"
vscode "jiejie.Lua-Nginx-Snippets"
vscode "jinhyuk.replace-curly-quotes"
vscode "jinsihou.diff-tool"
vscode "jmviz.quote-list"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "joshuapoehls.json-escaper"
vscode "jtcontreras90.yaml-path-extractor"
vscode "juanmnl.vscode-theme-hydra"
vscode "KevinRose.vsc-python-indent"
vscode "kleber-swf.ocean-dark-extended"
vscode "L13RARY.l13-diff"
vscode "lextudio.restructuredtext"
vscode "luggage66.AWK"
vscode "lunuan.kubernetes-templates"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maelvalais.autoconf"
vscode "malmaud.tmux"
vscode "marcostazi.VS-code-vagrantfile"
vscode "mblode.pretty-formatter"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "milovidov.escape-quotes"
vscode "mohsen1.prettify-json"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "MrAnno.syslog-ng"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "msysyamamoto.vscode-fluentd"
vscode "narsenico.vscode-progressive-increment"
vscode "Naturalclar.workspace-settings-json"
vscode "naumovs.color-highlight"
vscode "nemesv.copy-file-name"
vscode "nidu.copy-json-path"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "octref.vscode-json-transform"
vscode "oderwat.indent-rainbow"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "pepri.subtitles-editor"
vscode "phplasma.csv-to-table"
vscode "pnp.polacode"
vscode "PYGC.spacetab"
vscode "rafaelmaiolla.diff"
vscode "rafaelmaiolla.remote-vscode"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "Remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "richie5um2.vscode-statusbar-json-path"
vscode "rido3.wordcount"
vscode "RobbOwen.synthwave-vscode"
vscode "RoscoP.ActiveFileInStatusBar"
vscode "rpinski.shebang-snippets"
vscode "Rubymaniac.vscode-paste-and-indent"
vscode "rupisaini.vscode-ansible-linter"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "sadesyllas.explorer-excluded-files"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.night-owl"
vscode "secsamdev.grok"
vscode "sgryjp.vscode-stable-sort"
vscode "shanoor.vscode-nginx"
vscode "sharat.vscode-brewfile"
vscode "Shinotatwu-DS.file-tree-generator"
vscode "sleistner.vscode-fileutils"
vscode "telesoho.vscode-markdown-paste-image"
vscode "thegtproject.hoverhex"
vscode "Thog.vscode-asl"
vscode "timonwong.ansible-autocomplete"
vscode "timonwong.shellcheck"
vscode "tushortz.python-extended-snippets"
vscode "tuxtina.json2yaml"
vscode "Tyriar.sort-lines"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "Wattenberger.footsteps"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
vscode "xrc-inc.jsonnet-formatter"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "Zarel.sublime-commands"
vscode "zengxingxin.sort-js-object-keys"
vscode "ziyasal.vscode-open-in-github"
